# Data Science, Tirgul 1
## Smaller

### Great python numpy tutorials  in Jupyter lab:
[Link to Jupyter Lab Tutorials](https://www.youtube.com/watch?v=7wfPqAyYADY&list=PLcD0MjpSMpGRoZgeb509_yICnabm4PYqc)

# Hebrew tutorial for Jupyter Notebook (the old version before Jupyter Lab)
[Link](https://www.youtube.com/watch?v=g9EglM7Ymns)

# Installation instructions:
# https://www.youtube.com/watch?v=uOwCiZKj2rg

# Data sciene income:

+ [Nisha](https://www.nisha.co.il/%D7%98%D7%91%D7%9C%D7%90%D7%95%D7%AA-%D7%A9%D7%9B%D7%A8)
+ [All Jobs](https://www.alljobs.co.il/User/SalaryCompound/position/?JobCategoryID=1733)

# Same Python commands work here too..

In [2]:
print("Hello Jupyter Lab")

Hello Jupyter Lab

# Jupiter Lab keyboard shortcuts
### https://gist.github.com/discdiver/9e00618756d120a8c9fa344ac1c375ac

#### Keyboard shotrctus greatly increase productivity, here are some commons:
+ note there are modes: Command mode (outside the cells) and edit mode (inside a cell)
+ Edit mode -> command mode: Esc
+ Command mode ->  edit mode: Enter
+ Toggle hide/show left sidebar: Ctrl+B
+ toggle comment: Ctrl + / 
+ Indent: Ctrl + ]  
+ Dedent: Ctrl + [

# Jupiter lab has a markdown \ code option mode.
# (Header 1, title)
## (Header 2, major headings)
### (Header 3, subheadings)
#### (Header 4)
##### (Header 5)
###### (Header 6)

## Markdown Cheat-sheet
[Link](https://github.com/adam-p/markdown-here/wiki/Markdown-Cheatsheet)

## Using LaTex equations in Jupyter
$ x^2 + y^2 = z^2 $

In [4]:
# cmd view point denoted by ! sign
!pip install pandas 

# Needs to be done only once

Requirement already satisfied: pandas in c:\users\ifrye\anaconda3\lib\site-packages (0.25.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\ifrye\anaconda3\lib\site-packages (from pandas) (2019.3)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\ifrye\anaconda3\lib\site-packages (from pandas) (2.8.0)
Requirement already satisfied: numpy>=1.13.3 in c:\users\ifrye\anaconda3\lib\site-packages (from pandas) (1.16.5)
Requirement already satisfied: six>=1.5 in c:\users\ifrye\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.12.0)

The system cannot find the path specified.

In [25]:
# Read file using pandas
# Pandas is a fast, powerful, flexible and easy to use open-source data analysis in python

import pandas as pd
data = pd.read_csv('titanic_short.csv')
data

   pclass  survived      age     sex
0     1st         1  29.0000  female
1     1st         0   2.0000  female
2     1st         0  30.0000    male
3     1st         0  25.0000  female
4     1st         1   0.9167    male
5     1st         1  47.0000    male
6     1st         1  63.0000  female
7     1st         0  39.0000    male
8     1st         1  58.0000  female
9     1st         0  71.0000    male
10    1st         0  47.0000    male
11    1st         1  19.0000  female
12    1st         1      NaN  female
13    1st         1      NaN    male
14    1st         0      NaN    male
15    1st         1  50.0000  female
16    1st         0  24.0000    male
17    1st         0  36.0000    male
18    1st         1  37.0000    male
19    1st         1      NaN  female
20    1st         1  26.0000    male
21    1st         0  25.0000    male
22    1st         1      NaN    male
23    1st         1  19.0000  female
24    1st         1  28.0000    male
25    1st         0      NaN    male
26    1st         1  39.0000    male
27    1st         1  30.0000  female
28    1st         1  58.0000  female
29    1st         0      NaN    male

## Self excercise: Suggest how to display only survivors (denoted in 1)

In [27]:
data[data['survived'] == 1]

   pclass  survived      age     sex
0     1st         1  29.0000  female
4     1st         1   0.9167    male
5     1st         1  47.0000    male
6     1st         1  63.0000  female
8     1st         1  58.0000  female
11    1st         1  19.0000  female
12    1st         1      NaN  female
13    1st         1      NaN    male
15    1st         1  50.0000  female
18    1st         1  37.0000    male
19    1st         1      NaN  female
20    1st         1  26.0000    male
22    1st         1      NaN    male
23    1st         1  19.0000  female
24    1st         1  28.0000    male
26    1st         1  39.0000    male
27    1st         1  30.0000  female
28    1st         1  58.0000  female

## Self excercise: Suggest how to display only females gender

In [28]:
data[data['sex']=='female']

   pclass  survived   age     sex
0     1st         1  29.0  female
1     1st         0   2.0  female
3     1st         0  25.0  female
6     1st         1  63.0  female
8     1st         1  58.0  female
11    1st         1  19.0  female
12    1st         1   NaN  female
15    1st         1  50.0  female
19    1st         1   NaN  female
23    1st         1  19.0  female
27    1st         1  30.0  female
28    1st         1  58.0  female

## Self excercise: Suggest how to display only females survivors

In [36]:
d = data[(data['survived'] == 1) & (data['sex']=='female')]
d[['pclass','age']]

   pclass   age
0     1st  29.0
6     1st  63.0
8     1st  58.0
11    1st  19.0
12    1st   NaN
15    1st  50.0
19    1st   NaN
23    1st  19.0
27    1st  30.0
28    1st  58.0

### Display some of the collumns

Emphasis, aka italics, with *asterisks* or _underscores_.

Strong emphasis, aka bold, with **asterisks** or __underscores__.

Combined emphasis with **asterisks and _underscores_**.

Strikethrough uses two tildes. ~~Scratch this.~~

In [ ]:
data[ [ 'pclass','age'] ]

In [ ]:
!pip install numpy
import numpy as np
arr = np.array([1, 2, 3, 4, 5])
# . product
print(arr*arr)

In [ ]:
#### vector multiplication
print("arr.dot(arr) =\n",arr.dot(arr))
# or by 
print("arr@arr =\n",arr@arr)